{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "BatchNormalization", "config": {"axis": -1, "dtype": "float32", "center": true, "beta_constraint": null, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "epsilon": 0.001, "batch_input_shape": [null, 80, 160, 3], "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "momentum": 0.99}}, {"class_name": "Conv2D", "config": {"filters": 60, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv1", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"filters": 50, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv2", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 40, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv3", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"filters": 30, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv4", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "trainable": true, "seed": null, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"filters": 20, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv5", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_3", "trainable": true, "seed": null, "rate": 0.2}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"filters": 10, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv6", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_4", "trainable": true, "seed": null, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"filters": 5, "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "Conv7", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_5", "trainable": true, "seed": null, "rate": 0.2}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "padding": "valid", "trainable": true}}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_last", "name": "up_sampling2d_1", "trainable": true, "interpolation": "nearest", "size": [2, 2]}}, {"class_name": "Conv2DTranspose", "config": {"filters": 10, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "output_padding": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "Deconv1", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_6", "trainable": true, "seed": null, "rate": 0.2}}, {"class_name": "Conv2DTranspose", "config": {"filters": 20, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "output_padding": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "Deconv2", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_7", "trainable": true, "seed": null, "rate": 0.2}}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_last", "name": "up_sampling2d_2", "trainable": true, "interpolation": "nearest", "size": [2, 2]}}, {"class_name": "Conv2DTranspose", "config": {"filters": 30, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "output_padding": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "Deconv3", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_8", "trainable": true, "seed": null, "rate": 0.2}}, {"class_name": "Conv2DTranspose", "config": {"filters": 40, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "output_padding": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "Deconv4", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_9", "trainable": true, "seed": null, "rate": 0.2}}, {"class_name": "Conv2DTranspose", "config": {"filters": 50, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "output_padding": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "Deconv5", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_10", "trainable": true, "seed": null, "rate": 0.2}}, {"class_name": "UpSampling2D", "config": {"data_format": "channels_last", "name": "up_sampling2d_3", "trainable": true, "interpolation": "nearest", "size": [2, 2]}}, {"class_name": "Conv2DTranspose", "config": {"filters": 60, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "output_padding": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "Deconv6", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Conv2DTranspose", "config": {"filters": 1, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "output_padding": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "Final", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "trainable": true, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null}}]}}